
#include <iostream> 

// Number of vertices in the graph 
#define V 9 


int main() 
{ 
	int graph[V][V] = { { 0, 4 , 0, 0 , 0 , 0 , 0, 8 , 0 }, 
						{ 4, 0 , 8, 0 , 0 , 0 , 0, 11, 0 }, 
						{ 0, 8 , 0, 7 , 0 , 4 , 0, 0 , 2 }, 
						{ 0, 0 , 7, 0 , 9 , 14, 0, 0 , 0 }, 
						{ 0, 0 , 0, 9 , 0 , 10, 0, 0 , 0 }, 
						{ 0, 0 , 4, 14, 10, 0 , 2, 0 , 0 }, 
						{ 0, 0 , 0, 0 , 0 , 2 , 0, 1 , 6 }, 
						{ 8, 11, 0, 0 , 0 , 0 , 1, 0 , 7 },
						{ 0, 0 , 2, 0 , 0 , 0 , 6, 7 , 0 } }; 
	// TODO: направи го със списък на съседи		
	return 0; 
}